# Classification Exercises 
#### Corey Solitaire
#### 9/8/2020

In [2]:
import pandas as pd
import numpy as np
import os

import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

from math import sqrt
from scipy import stats

# Data Acquisition

# 1 In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [ ]:
iris = sns.load_dataset('iris')

###   - print the first 3 rows

In [ ]:
print(iris.head(3))

###     - print the number of rows and columns (shape)

In [ ]:
print(iris.shape)

###    - print the column names

In [ ]:
print(iris.columns)

###    - print the data type of each column

In [ ]:
print(iris.dtypes)

In [ ]:
#more info is necessary
iris.info()

###     - print the summary statistics for each of the numeric variables. Would you recommend rescaling the data based on these statistics?

In [ ]:
print(iris.describe())

In [ ]:
print(iris.sepal_length.var(),
iris.sepal_width.var(),
iris.petal_length.var(),
iris.petal_width.var())

#### Petal length is much more variable then other measurments, I might reccomend scaling depending on the factors being examined

# 2. Read the Table1_CustDetails table from the Excel_Exercises.xlsx file into a dataframe named df_excel.

In [ ]:
customer = pd.read_excel('Spreadsheets_Exercises.xlsx')
customer.head()

###      -assign the first 100 rows to a new dataframe, df_excel_sample

In [ ]:
df_excel_sample = customer.head(100)
df_excel_sample.info

###      -print the number of rows of your original dataframe

In [ ]:
print(customer.shape)

In [ ]:
#alternate option
customer.shape[0]

###      -print the first 5 column names

In [ ]:
print("Select First 5 columns:")
print(customer[['customer_id', 'gender', 'is_senior_citizen', 'partner', 'dependents']])

In [ ]:
# alternate method

customer.columns[:5]

###      -print the column names that have a data type of object

In [ ]:
filteredColumns = customer.dtypes[customer.dtypes == np.object]
listOfColumnNames = list(filteredColumns.index)
print(listOfColumnNames)

###     -compute the range for each of the numeric variables.

In [ ]:
#Transcribes table
stats =customer._get_numeric_data().describe().T
stats

In [ ]:
stats['range'] = stats['max'] - stats['min']
stats[['mean', '50%', 'std', 'range']]

# 3. Read the data from this google sheet into a dataframe, df_google

In [ ]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'    

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_googlesheet = pd.read_csv(csv_export_url)
df_googlesheet.head()

###    -print the first 3 rows

In [ ]:
print(df_googlesheet.head(3))

###    -print the number of rows and columns

In [ ]:
df_googlesheet.shape

###    -print the first five column names

In [ ]:
df_googlesheet.columns[:5]

In [ ]:
# alternate print to list for ease of access
df_googlesheet.columns.to_list()

###     -print the data type of each column

In [ ]:
df_googlesheet.dtypes

###     -print the summary statistics for each of the numeric variables

In [ ]:
df_googlesheet._get_numeric_data().describe()

###   -print the unique values for each of your categorical variables

In [ ]:
#df_googlesheet.select_dtypes(object)

df_ = df_googlesheet.select_dtypes(exclude=['int', 'float'])
for col in df_.columns:
    print(df_[col].unique()) # to print categories name only
    print(df_[col].value_counts())

In [ ]:
#alternate from faith
for col in df_googlesheet:
    if df_googlesheet[col].dtypes == 'object':
        print(f'{col} has {df_googlesheet[col].nunique()} unique values.')

# Make a new python module, acquire.py to hold the following data aquisition functions:

### 1. Make a function named get_titanic_data that returns the titanic data from the codeup data science database as a pandas data frame. Obtain your data from the Codeup Data Science Database.

In [ ]:
import env

def get_connection(db, user=env.user, host=env.host, password=env.password):
    return f'mysql+pymysql://{user}:{password}@{host}/{db}'

df = pd.read_sql('SELECT * FROM passengers', get_connection('titanic_db'))

df.head()

### 2. Make a function named get_iris_data that returns the data from the iris_db on the codeup data science database as a pandas data frame. The returned data frame should include the actual name of the species in addition to the species_ids. Obtain your data from the Codeup Data Science Database.

In [ ]:
def get_iris_data():
    return pd.read_sql('SELECT * FROM measurements AS m JOIN species AS s on m.species_id = s.species_id', get_connection('iris_db'))

df = get_iris_data()
df.head()

### 3. Once you've got your get_titanic_data and get_iris_data functions written, now it's time to add caching to them. To do this, edit the beginning of the function to check for a local filename like titanic.csv or iris.csv. If they exist, use the .csv file. If the file doesn't exist, then produce the SQL and pandas necessary to create a dataframe, then write the dataframe to a .csv file with the appropriate name.

In [ ]:
#Titanic Dataset

# def get_titanic_data():
#     filename = "titanic.csv"

#     if os.path.isfile(filename):
#         return pd.read_csv(filename)
#     else:
#         # read the SQL query into a dataframe
#         df = pd.read_sql('SELECT * FROM passengers', get_connection('titanic_db'))

#         # Write that dataframe to disk for later. Called "caching" the data for later.
#         df.to_csv(filename, index = False)

#         # Return the dataframe to the calling code
#     return df

#import acquire
#acquire.get_titanic_data()

In [ ]:
#Iris Dataset

# def get_iris_data():
#     filename = "iris.csv"

#     if os.path.isfile(filename):
#        return pd.read_csv(filename)
#     else:
#         #read the SQL query into a dataframe
#         df = pd.read_sql('SELECT * FROM measurements AS m JOIN species AS s on m.species_id = s.species_id', get_connection('iris_db'))

#         #Write that dataframe to disk for later. Called "caching" the data for later.
#         df.to_csv(filename, index = False)

#         #Return the dataframe to the calling code
#     return df

#import acquire
#acquire.get_iris_data()

# Data Preparation

#### - Prepare Enviroment

In [3]:
import pandas as pd
import numpy as np
from acquire import *

import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import LabelEncoder, OneHotEncoder, MinMaxScaler

import warnings
warnings.filterwarnings("ignore")



- Iris Data

    - Use the function defined in acquire.py to load the iris data.
    - Drop the species_id and measurement_id columns.
    - Rename the species_name column to just species.
    - Encode the species name using a sklearn label encoder. Research the inverse_transform method of the label encoder. How might this be useful?
    - Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [ ]:
 
'''
This function reads in iris data from Codeup database if cached == False
or if cached == True reads in iris df from a csv file, returns df
'''
# I ran this code first, to import data and save it as a dataframe
#iris = get_iris_data(cached=True)

iris = get_iris_data(cached=True)
iris.head()

In [ ]:
# Drop the species_id and measurement_id columns.

cols_to_drop = ['species_id']
iris = iris.drop(columns=cols_to_drop)
iris.head()

In [ ]:
# Rename the species_name column to just species.

iris.rename(columns = {'species_name':'species'}, inplace = True)
iris.head()

In [ ]:
# Train/Validate/Test Split

train_validate, test = train_test_split(iris, test_size=.2, 
                                        random_state=123, 
                                        stratify=iris.species)

train_validate.shape, test.shape

In [ ]:
train, validate = train_test_split(train_validate, test_size=.3, 
                                   random_state=123, 
                                   stratify=train_validate.species)
train.shape, validate.shape

In [ ]:
# Encode the species name using a sklearn label encoder. 
# Research the inverse_transform method of the label encoder. How might this be useful?

def label_encode(train, test):
    le = LabelEncoder()
    train['species'] = le.fit_transform(train.species)
    test['species'] = le.transform(test.species)
    return le, train, test

In [ ]:
label_encode(train, test)

In [ ]:
# Research the inverse_transform method of the label encoder. How might this be useful?

'''
Used to transform the data back in to categories after modeling for analysis
'''

In [ ]:
#Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

def prep_iris(df):
    le = LabelEncoder()
    df = df.drop(columns='species_id')
    df = df.rename(columns={'species_name': 'species'})
    train, test = train_test_split(df, train_size=.75, stratify=df.species, random_state=123)
    train, test, le = label_encode(train, test)
    return train, test, le

In [ ]:
prep_iris(iris)

# Titanic Data

####     Use the function you defined in acquire.py to load the titanic data set.

In [26]:
'''
This function reads in titanic data from Codeup database if cached == False
or if cached == True reads in iris df from a csv file, returns df
'''
# I ran this code first, to import data and save it as a dataframe
#iris = get_iris_data(cached=True)

titanic = get_titanic_data(cached=True)
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

####     Handle the missing values in the embark_town and embarked columns.

In [27]:
# Dropped these colums because they are repeats, or do not provide extra insight in to who survived
cols_to_drop = ['embarked', 'class', 'passenger_id']
titanic = titanic.drop(columns=cols_to_drop)
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,deck,embark_town,alone
0,0,3,male,22.0,1,0,7.2500,None,Southampton,0
1,1,1,female,38.0,1,0,71.2833,C,Cherbourg,0
2,1,3,female,26.0,0,0,7.9250,None,Southampton,1
3,1,1,female,35.0,1,0,53.1000,C,Southampton,0
4,0,3,male,35.0,0,0,8.0500,None,Southampton,1

In [28]:
# drop missing observations of embark town
titanic = titanic[~titanic.embark_town.isnull()]

####     Remove the deck column.

In [29]:
cols_to_drop = ['deck']
titanic = titanic.drop(columns=cols_to_drop)
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare  embark_town  alone
0         0       3    male  22.0      1      0   7.2500  Southampton      0
1         1       1  female  38.0      1      0  71.2833    Cherbourg      0
2         1       3  female  26.0      0      0   7.9250  Southampton      1
3         1       1  female  35.0      1      0  53.1000  Southampton      0
4         0       3    male  35.0      0      0   8.0500  Southampton      1

####    Use a label encoder to transform the embarked column.

In [30]:
#first we have to train/validate/test split data

train_validate, test = train_test_split(titanic, test_size=.2, 
                                        random_state=123, 
                                        stratify=titanic.survived)

train, validate = train_test_split(train_validate, test_size=.3, 
                                   random_state=123, 
                                   stratify=train_validate.survived)

In [31]:
train.isnull().sum()

survived        0
pclass          0
sex             0
age            97
sibsp           0
parch           0
fare            0
embark_town     0
alone           0
dtype: int64

In [32]:
test.isnull().sum()

survived        0
pclass          0
sex             0
age            44
sibsp           0
parch           0
fare            0
embark_town     0
alone           0
dtype: int64

In [33]:
def label_encode(train, test):
    le = LabelEncoder()
    train['embark_town'] = le.fit_transform(train.embark_town)
    test['embark_town'] = le.transform(test.embark_town)
    return le, train, test

In [34]:
label_encode(train, test)

(LabelEncoder(),
      survived  pclass     sex   age  sibsp  parch      fare  embark_town  \
 583         0       1    male  36.0      0      0   40.1250            0
 337         1       1  female  41.0      0      0  134.5000            0
 50          0       3    male   7.0      4      1   39.6875            2
 218         1       1  female  32.0      0      0   76.2917            0
 31          1       1  female   NaN      1      0  146.5208            0
 ..        ...     ...     ...   ...    ...    ...       ...          ...
 313         0       3    male  28.0      0      0    7.8958            2
 636         0       3    male  32.0      0      0    7.9250            2
 222         0       3    male  51.0      0      0    8.0500            2
 485         0       3  female   NaN      3      1   25.4667            2
 553         1       3    male  22.0      0      0    7.2250            0

      alone
 583      1
 337      1
 50       0
 218      1
 31       0
 ..     ...
 313      1
 636      1
 222      1
 485      0
 553      1

 [497 rows x 9 columns],
      survived  pclass     sex   age  sibsp  parch      fare  embark_town  \
 561         0       3    male  40.0      0      0    7.8958            2
 328         1       3  female  31.0      1      1   20.5250            2
 643         1       3    male   NaN      0      0   56.4958            2
 498         0       1  female  25.0      1      2  151.5500            2
 875         1       3  female  15.0      0      0    7.2250            0
 ..        ...     ...     ...   ...    ...    ...       ...          ...
 339         0       1    male  45.0      0      0   35.5000            2
 841         0       2    male  16.0      0      0   10.5000            2
 442         0       3    male  25.0      1      0    7.7750            2
 815         0       1    male   NaN      0      0    0.0000            2
 809         1       1  female  33.0      1      0   53.1000            2

      alone
 561      1
 328      0
 643      1
 498      0
 875      1
 ..     ...
 339      1
 841      1
 442      0
 815      1
 809      0

 [178 rows x 9 columns])

####     Scale the age and fare columns using a min max scaler. Why might this be beneficial? When might you not want to do this?

In [39]:
def scale_columns(train, test):
    scaler = MinMaxScaler()
    train[['age','fare']] = scaler.fit_transform(train[['age','fare']])
    test[['age','fare']] = scaler.transform(test[['age','fare']])
    return scaler, train, test

In [40]:
scale_columns(train, test)

(MinMaxScaler(),
      survived  pclass     sex       age  sibsp  parch      fare  embark_town  \
 583         0       1    male  0.445355      0      0  0.078319            0
 337         1       1  female  0.508383      0      0  0.262527            0
 50          0       3    male  0.079793      4      1  0.077465            2
 218         1       1  female  0.394933      0      0  0.148911            0
 31          1       1  female  0.368674      1      0  0.285990            0
 ..        ...     ...     ...       ...    ...    ...       ...          ...
 313         0       3    male  0.344510      0      0  0.015412            2
 636         0       3    male  0.394933      0      0  0.015469            2
 222         0       3    male  0.634438      0      0  0.015713            2
 485         0       3  female  0.368674      3      1  0.049708            2
 553         1       3    male  0.268877      0      0  0.014102            0

      alone
 583      1
 337      1
 50       0
 218      1
 31       0
 ..     ...
 313      1
 636      1
 222      1
 485      0
 553      1

 [497 rows x 9 columns],
      survived  pclass     sex       age  sibsp  parch      fare  embark_town  \
 561         0       3    male  0.495777      0      0  0.015412            2
 328         1       3  female  0.382327      1      1  0.040062            2
 643         1       3    male  0.368674      0      0  0.110272            2
 498         0       1  female  0.306694      1      2  0.295806            2
 875         1       3  female  0.180638      0      0  0.014102            0
 ..        ...     ...     ...       ...    ...    ...       ...          ...
 339         0       1    male  0.558805      0      0  0.069291            2
 841         0       2    male  0.193243      0      0  0.020495            2
 442         0       3    male  0.306694      1      0  0.015176            2
 815         0       1    male  0.368674      0      0  0.000000            2
 809         1       1  female  0.407538      1      0  0.103644            2

      alone
 561      1
 328      0
 643      1
 498      0
 875      1
 ..     ...
 339      1
 841      1
 442      0
 815      1
 809      0

 [178 rows x 9 columns])

####     Fill the missing values in age. The way you fill these values is up to you. Consider the tradeoffs of different methods.

In [35]:
def impute_age(train, test):
    avg_age = train.age.mean()
    train.age = train.age.fillna(avg_age)
    test.age = test.age.fillna(avg_age)
    return train, test

In [36]:
impute_age(train, test)

(     survived  pclass     sex        age  sibsp  parch      fare  embark_town  \
 583         0       1    male  36.000000      0      0   40.1250            0
 337         1       1  female  41.000000      0      0  134.5000            0
 50          0       3    male   7.000000      4      1   39.6875            2
 218         1       1  female  32.000000      0      0   76.2917            0
 31          1       1  female  29.916875      1      0  146.5208            0
 ..        ...     ...     ...        ...    ...    ...       ...          ...
 313         0       3    male  28.000000      0      0    7.8958            2
 636         0       3    male  32.000000      0      0    7.9250            2
 222         0       3    male  51.000000      0      0    8.0500            2
 485         0       3  female  29.916875      3      1   25.4667            2
 553         1       3    male  22.000000      0      0    7.2250            0

      alone
 583      1
 337      1
 50       0
 218      1
 31       0
 ..     ...
 313      1
 636      1
 222      1
 485      0
 553      1

 [497 rows x 9 columns],
      survived  pclass     sex        age  sibsp  parch      fare  embark_town  \
 561         0       3    male  40.000000      0      0    7.8958            2
 328         1       3  female  31.000000      1      1   20.5250            2
 643         1       3    male  29.916875      0      0   56.4958            2
 498         0       1  female  25.000000      1      2  151.5500            2
 875         1       3  female  15.000000      0      0    7.2250            0
 ..        ...     ...     ...        ...    ...    ...       ...          ...
 339         0       1    male  45.000000      0      0   35.5000            2
 841         0       2    male  16.000000      0      0   10.5000            2
 442         0       3    male  25.000000      1      0    7.7750            2
 815         0       1    male  29.916875      0      0    0.0000            2
 809         1       1  female  33.000000      1      0   53.1000            2

      alone
 561      1
 328      0
 643      1
 498      0
 875      1
 ..     ...
 339      1
 841      1
 442      0
 815      1
 809      0

 [178 rows x 9 columns])

In [37]:
train.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embark_town    0
alone          0
dtype: int64

In [38]:
test.isnull().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embark_town    0
alone          0
dtype: int64

####     Create a function named prep_titanic that accepts the untransformed titanic data, and returns the data with the   transformations above applied.

In [44]:
titanic = get_titanic_data(cached=True)
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,None,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,None,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,None,Southampton,1

In [45]:
def drop_columns(df):
    df.drop(columns=['deck'], inplace=True)
    return df

def impute_embark_town(train, test):
    train['embark_town'] = train['embark_town'].fillna('Southampton')
    test['embark_town'] = test['embark_town'].fillna('Southampton')
    return train, test

def impute_embarked(train, test):
    train['embarked'] = train['embarked'].fillna('S')
    test['embarked'] = test['embarked'].fillna('S')
    return train, test

def impute_age(train, test):
    avg_age = train.age.mean()
    train.age = train.age.fillna(avg_age)
    test.age = test.age.fillna(avg_age)
    return train, test

def scale_columns(train, test):
    scaler = MinMaxScaler()
    train[['age','fare']] = scaler.fit_transform(train[['age','fare']])
    test[['age','fare']] = scaler.transform(test[['age','fare']])
    return scaler, train, test

def ohe_columns(train, test):
    # create encoder
    ohe = OneHotEncoder(sparse=False, categories='auto')
    
    # fit scaler on train and transform train and test to dense matrices
    train_matrix = ohe.fit_transform(train[['embarked']])
    test_matrix = ohe.transform(test[['embarked']])
    
    # transform matrices to DataFrames
    train_ohe = pd.DataFrame(train_matrix, columns=ohe.categories_[0], index=train.index)
    test_ohe = pd.DataFrame(test_matrix, columns=ohe.categories_[0], index=test.index)
    
    # join encoded matrix with original train or test matrices
    train = train.join(train_ohe)
    test = test.join(test_ohe)
    
    return ohe, train, test

def prep_titanic(df):

    # drop the deck column bc most values Null
    drop_columns(df)
    
    train, test = train_test_split(df, train_size=.75, stratify=df.survived, random_state=123)
    
    # impute 2 NaNs in embark_town with most frequent value
    train, test = impute_embark_town(train, test)
    
    # impute 2 NaNs in embarked with most frequent value
    train, test = impute_embarked(train, test)
    
    # impute NaNs in age in train and test with the mean age in train
    train, test = impute_age(train, test)
    
    # use a minmax scaler on age and fare bc of differing measurement units
    scaler, train, test = scale_columns(train, test)
    
    # ohe embarked creating three new columns for C, Q, S representing embark towns
    ohe, train, test = ohe_columns(train, test)
    
    return scaler, ohe, train, test

In [46]:
prep_titanic(titanic)

(MinMaxScaler(),
 OneHotEncoder(sparse=False),
      passenger_id  survived  pclass     sex       age  sibsp  parch      fare  \
 683           683         0       3    male  0.184561      5      2  0.091543
 421           421         0       3    male  0.279696      0      0  0.015094
 336           336         0       1    male  0.388421      1      0  0.129995
 681           681         1       1    male  0.361239      0      0  0.149765
 610           610         0       3  female  0.524327      1      5  0.061045
 ..            ...       ...     ...     ...       ...    ...    ...       ...
 360           360         0       3    male  0.537918      1      4  0.054457
 635           635         1       2  female  0.374830      0      0  0.025374
 245           245         0       1    male  0.592281      2      0  0.175668
 768           768         0       3    male  0.389113      1      0  0.047138
 399           399         1       2  female  0.374830      0      0  0.024691

     embarked   class  embark_town  alone    C    Q    S
 683        S   Third  Southampton      0  0.0  0.0  1.0
 421        Q   Third   Queenstown      1  0.0  1.0  0.0
 336        S   First  Southampton      0  0.0  0.0  1.0
 681        C   First    Cherbourg      1  1.0  0.0  0.0
 610        S   Third  Southampton      0  0.0  0.0  1.0
 ..       ...     ...          ...    ...  ...  ...  ...
 360        S   Third  Southampton      0  0.0  0.0  1.0
 635        S  Second  Southampton      1  0.0  0.0  1.0
 245        Q   First   Queenstown      0  0.0  1.0  0.0
 768        Q   Third   Queenstown      0  0.0  1.0  0.0
 399        S  Second  Southampton      1  0.0  0.0  1.0

 [668 rows x 15 columns],
      passenger_id  survived  pclass     sex       age  sibsp  parch      fare  \
 114           114         0       3  female  0.225333      0      0  0.028221
 75             75         0       3    male  0.334058      0      0  0.014932
 52             52         1       1  female  0.660234      1      0  0.149765
 192           192         1       3  female  0.252514      1      0  0.015330
 575           575         0       3    male  0.252514      0      0  0.028302
 ..            ...       ...     ...     ...       ...    ...    ...       ...
 699           699         0       3    male  0.565099      0      0  0.014932
 510           510         1       3    male  0.388421      0      0  0.015127
 885           885         0       3  female  0.524327      0      5  0.056848
 559           559         1       3  female  0.483555      1      0  0.033963
 229           229         0       3  female  0.389113      3      1  0.049708

     embarked  class  embark_town  alone    C    Q    S
 114        C  Third    Cherbourg      1  1.0  0.0  0.0
 75         S  Third  Southampton      1  0.0  0.0  1.0
 52         C  First    Cherbourg      0  1.0  0.0  0.0
 192        S  Third  Southampton      0  0.0  0.0  1.0
 575        S  Third  Southampton      1  0.0  0.0  1.0
 ..       ...    ...          ...    ...  ...  ...  ...
 699        S  Third  Southampton      1  0.0  0.0  1.0
 510        Q  Third   Queenstown      1  0.0  1.0  0.0
 885        Q  Third   Queenstown      0  0.0  1.0  0.0
 559        S  Third  Southampton      0  0.0  0.0  1.0
 229        S  Third  Southampton      0  0.0  0.0  1.0

 [223 rows x 15 columns])